In [1]:
# The following two lines are for making the notebook show all output
# not only the last output. They are not related to tutorial.  

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

### What is it?
[pandas](http://pandas.pydata.org/) is an open source Python library for data analysis.

In [2]:
import pandas as pd

## Data Structures
pandas introduces two new data structures to Python - Series and DataFrame.

### Series

A Series is similar to a list. It will assign an index to each item it contains. By default, each item will receive an index label from 0 to N-1, where N is the size of the Series.

In [18]:
# create a Series with an arbitrary list
s = pd.Series(['John', 'Rich', 'Michael', 'Sue', 'Kath'])
s

0       John
1       Rich
2    Michael
3        Sue
4       Kath
dtype: object

You can use the index to select specific items from the Series ...

In [19]:
s[0]

'John'

In [20]:
s[[0, 3, 4]]

0    John
3     Sue
4    Kath
dtype: object

Or you can use boolean indexing for selection.

In [21]:
s[s < "R"]

0       John
2    Michael
4       Kath
dtype: object

That last one might be a little weird, so let's make it more clear - `s < 1000` returns a Series of True/False values, which we then pass to our Series `s`, returning the corresponding True items.

In [22]:
res = s < "R"
res

s[res]

0     True
1    False
2     True
3    False
4     True
dtype: bool

0       John
2    Michael
4       Kath
dtype: object

## DataFrame

A DataFrame is a tablular data structure comprised of rows and columns, akin to a spreadsheet, or database table. 
You can also think of a DataFrame as a group of Series objects that share an index.

**CSV**

Reading a CSV is as simple as calling the *read_csv* function. By default, the *read_csv* function expects the column separator to be a comma, but you can change that using the `sep` parameter.

In [1]:
titanic = pd.read_csv('titanic2.txt', sep='\t')

titanic.head()

NameError: name 'pd' is not defined

`head` displays the first five records of the dataframe.

Alternatively, Python's regular [slicing](http://docs.python.org/release/2.3.5/whatsnew/section-slices.html) syntax works as well.

In [9]:
titanic[20:22]

   pclass    age   sex survived
20    1st  adult  male      yes
21    1st  adult  male      yes

### Selecting

You can think of a DataFrame as a group of Series that share an index.
Selecting a single column from the DataFrame will return a *Series* object.

In [10]:
titanic['age']

0       adult
1       adult
2       adult
3       adult
4       adult
5       adult
6       adult
7       adult
8       adult
9       adult
10      adult
11      adult
12      adult
13      adult
14      adult
15      adult
16      adult
17      adult
18      adult
19      adult
20      adult
21      adult
22      adult
23      adult
24      adult
25      adult
26      adult
27      adult
28      adult
29      adult
        ...
2171    adult
2172    adult
2173    adult
2174    adult
2175    adult
2176    adult
2177    adult
2178    adult
2179    adult
2180    adult
2181    adult
2182    adult
2183    adult
2184    adult
2185    adult
2186    adult
2187    adult
2188    adult
2189    adult
2190    adult
2191    adult
2192    adult
2193    adult
2194    adult
2195    adult
2196    adult
2197    adult
2198    adult
2199    adult
2200    adult
Name: age, Length: 2201, dtype: object

To select multiple columns, simply pass a list of column names to the DataFrame, the output of which will be a *DataFrame*.

In [11]:
titanic[['age', 'pclass']]

        age pclass
0     adult    1st
1     adult    1st
2     adult    1st
3     adult    1st
4     adult    1st
5     adult    1st
6     adult    1st
7     adult    1st
8     adult    1st
9     adult    1st
10    adult    1st
11    adult    1st
12    adult    1st
13    adult    1st
14    adult    1st
15    adult    1st
16    adult    1st
17    adult    1st
18    adult    1st
19    adult    1st
20    adult    1st
21    adult    1st
22    adult    1st
23    adult    1st
24    adult    1st
25    adult    1st
26    adult    1st
27    adult    1st
28    adult    1st
29    adult    1st
...     ...    ...
2171  adult   crew
2172  adult   crew
2173  adult   crew
2174  adult   crew
2175  adult   crew
2176  adult   crew
2177  adult   crew
2178  adult   crew
2179  adult   crew
2180  adult   crew
2181  adult   crew
2182  adult   crew
2183  adult   crew
2184  adult   crew
2185  adult   crew
2186  adult   crew
2187  adult   crew
2188  adult   crew
2189  adult   crew
2190  adult   crew
2191  adult   crew
2192  adult   crew
2193  adult   crew
2194  adult   crew
2195  adult   crew
2196  adult   crew
2197  adult   crew
2198  adult   crew
2199  adult   crew
2200  adult   crew

[2201 rows x 2 columns]

Row selection can be done multiple ways, but doing so by an individual index or boolean indexing are typically easiest.

In [26]:
titanic[(titanic.age=='child') & (titanic.pclass=='2nd')]      #parenthesis are needed

    pclass    age     sex survived
586    2nd  child    male      yes
587    2nd  child    male      yes
588    2nd  child    male      yes
589    2nd  child    male      yes
590    2nd  child    male      yes
591    2nd  child    male      yes
592    2nd  child    male      yes
593    2nd  child    male      yes
594    2nd  child    male      yes
595    2nd  child    male      yes
596    2nd  child    male      yes
597    2nd  child  female      yes
598    2nd  child  female      yes
599    2nd  child  female      yes
600    2nd  child  female      yes
601    2nd  child  female      yes
602    2nd  child  female      yes
603    2nd  child  female      yes
604    2nd  child  female      yes
605    2nd  child  female      yes
606    2nd  child  female      yes
607    2nd  child  female      yes
608    2nd  child  female      yes
609    2nd  child  female      yes

We can select rows *by position* using the `iloc` method or by using slicing. Here are a few examples.

In [13]:
# three different ways to do the same thing

titanic.iloc[99]
titanic[99:100]
titanic.iloc[99:100]

# What do you observe?

pclass        1st
age         adult
sex          male
survived       no
Name: 99, dtype: object

   pclass    age   sex survived
99    1st  adult  male       no

   pclass    age   sex survived
99    1st  adult  male       no

### Grouping

pandas `groupby` returns a DataFrame GroupBy object which has a variety of methods, many of which are similar to standard SQL aggregate functions.

In [27]:
by_age = titanic.groupby('age')
by_age

Calling `count` returns the total number of NOT NULL values within each column. If we were interested in the total number of records in each group, we could use `size`.

In [15]:
by_age.count() # NOT NULL records within each column
by_age.size() # total records for each group

       pclass   sex  survived
age
adult    2092  2092      2092
child     109   109       109

age
adult    2092
child     109
dtype: int64

In [28]:
titanic.groupby(['sex']).size()
titanic.groupby(['survived', 'sex']).size()

sex
female     470
male      1731
dtype: int64

survived  sex
no        female     126
          male      1364
yes       female     344
          male       367
dtype: int64

### Pivot Tables

The simplest pivot table must have a dataframe and an index. In this case, let’s use the survived as our index.

When you count specify in values any attribute that is not in index or columns.

In [17]:
import numpy as np

pd.pivot_table(titanic, index=["survived"], values=['age'], columns=['sex'], aggfunc=np.count_nonzero, margins=True)

            age
sex      female    male     All
survived
no        126.0  1364.0  1490.0
yes       344.0   367.0   711.0
All       470.0  1731.0  2201.0